## Challenge 1

In [1]:
import sqlite3

In [2]:
con = sqlite3.connect('temp_db.db')
cursorObj = con.cursor()

## Challenge 2

In [3]:
cursorObj.execute('CREATE TABLE IF NOT EXISTS emp(empno INTEGER,ename TEXT,salary INTEGER,deptno INTEGER)')

## Challenge 3

In [4]:
def insert(eno,ena,s,d):
    con = sqlite3.connect('temp_db.db')
    cursorObj = con.cursor()
    cursorObj.execute('INSERT INTO emp values(?,?,?,?)',(eno,ena,s,d))
    con.commit()
    con.close()

In [5]:
insert(101,'Ramesh',15000,10)

In [6]:
insert(102,'Suresh',22000,10)

In [7]:
insert(103,'Mahesh',21000,30)

In [8]:
insert(104,'Dinesh',25000,30)

In [9]:
insert(105,'Harish',26000,10)

## Challenge 4

In [10]:
# From emp table, displaying all records

def view():
    conn = sqlite3.connect('temp_db.db')
    cur = conn.cursor()
    cur.execute('SELECT * FROM emp')
    rows = cur.fetchall()
    conn.close()
    return rows

In [11]:
view()

[(101, 'Ramesh', 15000, 10),
 (102, 'Suresh', 22000, 10),
 (103, 'Mahesh', 21000, 30),
 (104, 'Dinesh', 25000, 30),
 (105, 'Harish', 26000, 10)]

## Challenge 5

In [12]:
def view1(s,d):
    conn = sqlite3.connect('temp_db.db')
    cur = conn.cursor()
    cur.execute('SELECT empno,ename,salary,deptno FROM emp where deptno=? and salary>?',(d,s))
    rows = cur.fetchall()
    conn.close()
    return rows

In [13]:
view1(15000,10)

[(102, 'Suresh', 22000, 10), (105, 'Harish', 26000, 10)]

## Challenge 6

In [14]:
def view2(d):
    conn = sqlite3.connect('temp_db.db')
    cur = conn.cursor()
    cur.execute('SELECT empno,ename,salary,deptno FROM emp where deptno!=? and salary BETWEEN 20000 AND 25000',(d,))
    rows = cur.fetchall()
    conn.close()
    return rows

In [15]:
view2(10)

[(103, 'Mahesh', 21000, 30), (104, 'Dinesh', 25000, 30)]

## Challenge 7

In [16]:
def view3():
    conn = sqlite3.connect('temp_db.db')
    cur = conn.cursor()
    cur.execute('SELECT * FROM emp where ename LIKE "M%"')
    rows = cur.fetchall()
    conn.close()
    return rows

In [17]:
view3()

[(103, 'Mahesh', 21000, 30)]

## Challenge 8

In [18]:
def delete(d):
    conn = sqlite3.connect('temp_db.db')
    cur = conn.cursor()
    cur.execute('DELETE FROM emp where deptno = ?',(d,))
    conn.commit()
    conn.close()

In [19]:
delete(30)

In [20]:
view()

[(101, 'Ramesh', 15000, 10),
 (102, 'Suresh', 22000, 10),
 (105, 'Harish', 26000, 10)]

## Challenge 9

In [21]:
def update3(s,d):
    conn = sqlite3.connect('temp_db.db')
    cur = conn.cursor()
    cur.execute('UPDATE emp SET salary=?*1.1 WHERE deptno=?',(s,d))
    conn.commit()
    conn.close()

In [22]:
update3(15000,101)

In [23]:
view()

[(101, 'Ramesh', 15000, 10),
 (102, 'Suresh', 22000, 10),
 (105, 'Harish', 26000, 10)]

## Challenge 10

In [24]:
def delete():
    conn = sqlite3.connect('temp_db.db')
    cur = conn.cursor()
    cur.execute('DELETE FROM emp')
    conn.commit()
    conn.close()

In [25]:
delete()

In [26]:
view()

[]

In [27]:
def drop():
    conn = sqlite3.connect('temp_db.db')
    cur = conn.cursor()
    cur.execute('DROP TABLE emp')
    conn.commit()
    conn.close()

In [28]:
drop()

In [29]:
view()

OperationalError: no such table: emp